app/Controllers/MiscCont.php

SELECT *
FROM `miscellaneous`
ORDER BY `id` DESC
---
    public function misc() {
        $qtyMisc = new MiscModel();
        $data['miscellaneous'] = $qtyMisc->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `miscellaneous`
ORDER BY `id`
---
    public function miscform() {
        $qtyMisc = new MiscModel();
        $data['miscellaneous'] = $qtyMisc->orderBy('id')->findAll();